{
    "profile": {
      "name": "Akwuru David Chibuike Ikechi",
      "image": "DavidAkwuru.jpg",
      "institution": {
        "title": "University of Limerick",
        "location": "Limerick, Ireland"
      },
      "role_badges": [
        "PhD Student",
        "Researcher",
        "Commonwealth Scholar"
      ],
      "homepage_url": "https://ng.linkedin.com/in/david-akwuru",
      "email": "akwuru.david@ul.ie",
      "supervisors": [
        "Prof. Katie Crowley",
        "Prof. Nina Orfali",
        "Prof. Aedin Culhane"
      ],
      "bio": [
        "Hi, I'm Akwuru David Chibuike Ikechi, a Doctoral student at the University of Limerick. My research focuses on building a framework for harmonizing data and enabling the federated sharing of AML cancer data across all of Ireland, under the guidance of Prof. Katie Crowley, Prof. Nina Orfali, and Prof. Aedin Culhane. We aim to adopt the OHDSI OMOP Common Data Model to harmonize AML data across healthcare institutions in Ireland and Northern Ireland, fostering improved research and clinical outcomes through interoperable data systems.",
        "I hold a Bachelor's degree in Computer Science from the University of Port Harcourt, Nigeria, and a Master's degree in Digital Health from the University of St. Andrews, United Kingdom, sponsored by the Commonwealth Scholarship Commission. My academic journey has been shaped by an interdisciplinary approach, bridging computing and healthcare to address critical challenges, especially in cancer research. This experience fuels my drive to leverage technology for enhanced clinical care and outcomes",
        "As part of my doctoral research, I have conducted a comprehensive landscape analysis of myeloid clinical data across institutions on the island of Ireland, identifying key gaps in data collection, sharing, and standardization. Currently, I am working on a scoping review to examine best practices for AML data management, sharing, and standardization in high-income countries, with the goal of adapting these strategies to benefit the Irish healthcare system. Ultimately, my work intends to create a unified framework for AML data that enhances interoperability, facilitates federated sharing, and improves collaborative research efforts across institutions. As Nelson Mandela once said, 'It always seems impossible until it is done.' This quote inspires my mission to overcome the challenges in harmonizing healthcare data and making meaningful progress in cancer research."
      ],
        "research_interests": [
        "Federated Data Sharing",
        "Myeloid Malignancies",
        "Cancer Research",
        "Machine Learning in Healthcare",
        "Biomedical Imaging",
        "Software Development",
        "Algorithms"
      ],
      "positions": [
        "PhD Student at University of Limerick"
      ],
      "key_initiatives": [
        {
          "title": "BCNI Symposium",
          "link": "https://www.bloodcancers.ie/bloodcancers/newsevents/bcni-blood-cancer-symposium---friday-24th-may-2024.html"
        },
        {
          "title": "Lero Summit in Athlone",
          "link": "https://www.ul.ie/news/five-university-of-limerick-researchers-presented-with-prestigious-lero-awards"
        },
        {
          "title": "OHDSI HDRUK Conference in the UK",
          "link": "https://www.hdruk.ac.uk/hdruk-conference-2024/"
        }
      ],
      "social_links": [
        {
          "name": "LinkedIn",
          "url": "https://www.linkedin.com/in/david-akwuru/"
        },
        {
          "name": "Twitter",
          "url": "https://x.com/AkwuruI"
        },
        {
            "name": "Github",
            "url": "https://github.com/DavidIkechi?tab=repositories"
        }
      ]
    }
  }

