{
    "profile": {
      "name": "Dr. Katie Crowley",
      "image": "KatieCrowley.png",
      "institution": {
        "title": "Associate Professor Computer Science & Health Informatics",
        "location": "Funded Investigator, Lero, University of Limerick"
      },
      "role_badges": [
        "Project Supervisor",
        "Limerick",
        "LDCRC"
      ],
      "homepage_url": "https://www.ul.ie/scieng/dr-katie-crowley",
      "email": "katie.crowley@ul.ie",
      "bio": [
        "Dr. Katie Crowley is an academic in the Department of Computer Science and Information Systems at the University of Limerick, where she serves as the Course Director for the MSc in Health Informatics. Her research focuses on the intersection of computer science and healthcare, with particular emphasis on affective computing, human-computer interaction, and health information technology.",
        "Katie's academic journey began with a BSc in Computer Science from University College Cork, followed by an MSc from the University of Limerick. She later completed her PhD in Computer Science at University College Cork, focusing on Affective Computing and Human-Computer Interaction, supported by an IRCSET scholarship.",
        "Throughout her career, Katie has built extensive experience in designing and managing research programs, working across multiple prestigious Irish institutions including Trinity College Dublin (Neuroscience/Psychology), University College Cork (Computer Science/Psychology), University of Limerick (Computer Science/Computer & Electronic Engineering), and Munster Technological University (Computer & Electronic Engineering).",
        "Katie has demonstrated strong leadership in research project management, from stakeholder collaboration to data analysis and implementation. Her work spans the full project lifecycle, emphasizing user-centered design principles and thorough documentation. She has secured significant national funding, including a Science Foundation Ireland Industry Fellowship grant, and regularly leads multidisciplinary teams in both academic and industry partnerships."
      ],
      "research_interests": [
        "Affective Computing",
        "Human Computer Interaction",
        "Health Informatics",
        "User Experience (UX)",
        "Health IoT/IoMT",
        "Psychophysiology",
        "Wearable Technology",
        "Digital Signal Processing",
        "Mobile Technology",
        "Social Technology"
      ],
      "expertise": [
        "Course Director, MSc in Health Informatics",
        "Project Management & Stakeholder Engagement",
        "User-Centered Design",
        "Interdisciplinary Research Leadership",
        "Industry-Academic Collaboration",
        "Research Methodology Development"
      ],
      "social_links": [
        {
          "name": "LinkedIn",
          "url": "https://www.linkedin.com/in/katiecrowley"
        },
        {
          "name": "GitHub",
          "url": "https://github.com/katiecrowley"
        },
        {
          "name": "Google Scholar",
          "url": "https://scholar.google.com/citations?user=aCA5y-YAAAAJ&hl=en"
        }
      ]
    }
  }
  